Revit 2023 API
PathReinforcement.PathReinforcementType Property
 Retrieves the type of the Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public PathReinforcementType PathReinforcementType { get; }
Visual Basic
Public ReadOnly Property PathReinforcementType As PathReinforcementType
	Get
Visual C++
public:
property PathReinforcementType^ PathReinforcementType {
	PathReinforcementType^ get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace